In [19]:
import pyodbc
import pandas as pd
import numpy as np

In [3]:
try:
    connection_string = pyodbc.connect('Driver={SQL Server};'
                                   'Server=DESKTOP-1JQT5VC\\SQLEXPRESS01;'
                                   'Database=sqltrial;'
                                   'Trusted_Connection=yes;'
                                  )
    
    connection_string.autocommit = True
        
    cursor=connection_string.cursor()
except connection_string.Error as e: 
    print("Error: Could not make connection to the Sqltrial database")
    print(e)



cursor.execute('SELECT @@SERVERNAME')

for i in cursor : 
    print(i)

('DESKTOP-1JQT5VC\\SQLEXPRESS01', )

Alternatively, can give servername as 'localhost\SQLEXPRESS01'

In [4]:
try:
    cursor.execute('SELECT name, database_id, create_date FROM sys.databases')
    for i in cursor : 
        print(i)
except cursor.Error as e: 
    print("Error: Could not get data from cursor connection")
    print(e)

('master', 1, datetime.datetime(2003, 4, 8, 9, 13, 36, 390000))
('tempdb', 2, datetime.datetime(2023, 2, 5, 15, 48, 3, 693000))
('model', 3, datetime.datetime(2003, 4, 8, 9, 13, 36, 390000))
('msdb', 4, datetime.datetime(2022, 10, 8, 6, 31, 57, 550000))
('sqltrial', 5, datetime.datetime(2023, 2, 5, 15, 54, 16, 243000))

In [5]:
## USING PANDAS
df = pd.read_sql_query('SELECT @@VERSION', connection_string)

C:\Users\Vinoth\AppData\Local\Temp\ipykernel_10088\8549416.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('SELECT @@VERSION', connection_string)

In [6]:
cursor.execute('SELECT * FROM sys.tables')
for i in cursor : 
    print(i)

('airline_data', 997578592, None, 1, 0, 'U ', 'USER_TABLE', datetime.datetime(2023, 2, 5, 16, 59, 14, 410000), datetime.datetime(2023, 2, 5, 17, 23, 16, 397000), False, False, False, 0, None, 11, False, True, False, False, False, False, False, 0, False, False, 0, 'TABLE', False, False, 0, 'SCHEMA_AND_DATA', 0, 'NON_TEMPORAL_TABLE', None, False, False, None, None, None, False, False, -1, -1, 'INFINITE', 0, 'NON_LEDGER_TABLE', None, False)

In [7]:
data = pd.read_csv (r'E:\Haritha\Git Repos\Flight-Price-Prediction\Flight-Price-Prediction-Dataset\Data_Train.csv')   
df = pd.DataFrame(data)

In [8]:
print(df)

           airline date_of_Journey    source destination  \
0           IndiGo      24/03/2019  Banglore   New Delhi
1        Air India        1/5/2019   Kolkata    Banglore
2      Jet Airways        9/6/2019     Delhi      Cochin
3           IndiGo       12/5/2019   Kolkata    Banglore
4           IndiGo        1/3/2019  Banglore   New Delhi
...            ...             ...       ...         ...
10678     Air Asia        9/4/2019   Kolkata    Banglore
10679    Air India      27/04/2019   Kolkata    Banglore
10680  Jet Airways      27/04/2019  Banglore       Delhi
10681      Vistara        1/3/2019  Banglore   New Delhi
10682    Air India        9/5/2019     Delhi      Cochin

                       route dep_Time    arrival_Time duration total_Stops  \
0                  BLR ? DEL    22:20  3/22/2023 1:10   2h 50m    non-stop
1      CCU ? IXR ? BBI ? BLR     5:50           13:15   7h 25m     2 stops
2      DEL ? LKO ? BOM ? COK     9:25  6/10/2023 4:25      19h     2 stops
3            CCU ? NAG ? BLR    18:05           23:30   5h 25m      1 stop
4            BLR ? NAG ? DEL    16:50           21:35   4h 45m      1 stop
...                      ...      ...             ...      ...         ...
10678              CCU ? BLR    19:55           22:25   2h 30m    non-stop
10679              CCU ? BLR    20:45           23:20   2h 35m    non-stop
10680              BLR ? DEL     8:20           11:20       3h    non-stop
10681              BLR ? DEL    11:30           14:10   2h 40m    non-stop
10682  DEL ? GOI ? BOM ? COK    10:55           19:15   8h 20m     2 stops

      additional_Info  price
0             No info   3897
1             No info   7662
2             No info  13882
3             No info   6218
4             No info  13302
...               ...    ...
10678         No info   4107
10679         No info   4145
10680         No info   7229
10681         No info  12648
10682         No info  11753

[10683 rows x 11 columns]

In [9]:
df.head()

,airline,date_of_Journey,source,destination,route,dep_Time,arrival_Time,duration,total_Stops,additional_Info,price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR ? DEL,22:20,3/22/2023 1:10,2h 50m,non-stop,No info,3897
1,Air India,1/5/2019,Kolkata,Banglore,CCU ? IXR ? BBI ? BLR,5:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/6/2019,Delhi,Cochin,DEL ? LKO ? BOM ? COK,9:25,6/10/2023 4:25,19h,2 stops,No info,13882
3,IndiGo,12/5/2019,Kolkata,Banglore,CCU ? NAG ? BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,1/3/2019,Banglore,New Delhi,BLR ? NAG ? DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   airline          10683 non-null  object
 1   date_of_Journey  10683 non-null  object
 2   source           10683 non-null  object
 3   destination      10683 non-null  object
 4   route            10682 non-null  object
 5   dep_Time         10683 non-null  object
 6   arrival_Time     10683 non-null  object
 7   duration         10683 non-null  object
 8   total_Stops      10682 non-null  object
 9   additional_Info  10683 non-null  object
 10  price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [11]:
    cursor.execute(
    '''
    CREATE TABLE airline_data2(
    airline varchar(50),
    date_of_Journey varchar(50),
    Source varchar(50),         
    Destination varchar(50),    
    Route varchar(50),         
    Dep_Time varchar(50),   
    Arrival_Time varchar(50),     
    Duration varchar(50),       
    Total_Stops varchar(50), 
    Additional_Info varchar(50),
    price int)
    '''
    )

In [12]:
cursor.execute('SELECT DB_NAME()')
for i in cursor : 
    print(i)

('sqltrial', )

In [13]:
cursor.execute('SELECT * FROM airline_data')
for i in cursor : 
    print(i)

In [14]:
cursor.execute('SELECT * FROM INFORMATION_SCHEMA.TABLES ')
for i in cursor : 
    print(i)

('sqltrial', 'dbo', 'airline_data', 'BASE TABLE')
('sqltrial', 'dbo', 'airline_data2', 'BASE TABLE')

In [15]:
cursor.execute('''
EXEC sp_rename 'dbo.airline_data.Destination', 'destination', 'COLUMN' 
''')

In [20]:
df.replace({np.inf: np.nan, -np.inf: np.nan}, inplace=True)
df = df.fillna(0)

The code above solves the error got below - 

ProgrammingError: ('42000', '[42000] [Microsoft][ODBC SQL Server Driver][SQL Server]The incoming tabular data stream (TDS) remote procedure call (RPC) protocol stream is incorrect. Parameter 8 (""): The supplied value is not a valid instance of data type float. Check the source data for invalid values. An example of an invalid value is data of numeric type with scale greater than precision. (8023) (SQLExecDirectW)')

In [24]:
for row in df.itertuples():
    cursor.execute('''
                INSERT INTO airline_data2 (airline,date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,  
    Total_Stops,Additional_Info,price)
                VALUES (?,?,?,?,?,?,?,?,?,?,?)
                ''',
                row.airline,
                row.date_of_Journey,
                row.source,
                row.destination,
                row.route,
                row.dep_Time,
                row.arrival_Time,
                row.duration,  
                row.total_Stops,
                row.additional_Info,
                row.price
                )

In [25]:
#cursor.execute('DELETE FROM airline_data')

In [34]:
# To select only certain rows from the csv file 
# Use skiprows to choose starting point and nrows to choose number of rows
infile = r'E:\Haritha\Git Repos\Flight-Price-Prediction\Flight-Price-Prediction-Dataset\Data_Train.csv'
df_somerows = pd.read_csv(infile, header=0, skiprows = range(1,1000), nrows=2000)

In [36]:
df_somerows.replace({np.inf: np.nan, -np.inf: np.nan}, inplace=True)
df_somerows = df_somerows.fillna(0)

In [37]:
df_somerows.head()

,airline,date_of_Journey,source,destination,route,dep_Time,arrival_Time,duration,total_Stops,additional_Info,price
0,Jet Airways,24/05/2019,Kolkata,Banglore,CCU ? BOM ? BLR,21:10,5/25/2023 4:40,7h 30m,1 stop,In-flight meal not included,9663
1,IndiGo,21/03/2019,Delhi,Cochin,DEL ? BOM ? COK,18:35,3/22/2023 1:35,7h,1 stop,No info,9264
2,SpiceJet,15/05/2019,Chennai,Kolkata,MAA ? CCU,9:45,12:00,2h 15m,non-stop,No info,3597
3,IndiGo,24/06/2019,Delhi,Cochin,DEL ? HYD ? COK,5:05,12:10,7h 5m,1 stop,No info,6442
4,Multiple carriers,9/5/2019,Delhi,Cochin,DEL ? BOM ? COK,17:30,5/10/2023 1:30,8h,1 stop,No info,15078

In [40]:
df_somerows.shape

(2000, 11)

In [41]:
df_somerows.tail()

,airline,date_of_Journey,source,destination,route,dep_Time,arrival_Time,duration,total_Stops,additional_Info,price
1995,Air India,24/03/2019,Delhi,Cochin,DEL ? BOM ? COK,4:00,3/25/2023 7:40,27h 40m,1 stop,No info,8635
1996,Jet Airways,27/06/2019,Delhi,Cochin,DEL ? BOM ? COK,9:00,19:00,10h,1 stop,No info,14714
1997,Jet Airways,18/05/2019,Kolkata,Banglore,CCU ? DEL ? BLR,20:25,5/19/2023 19:10,22h 45m,1 stop,No info,14151
1998,Multiple carriers,1/6/2019,Delhi,Cochin,DEL ? BOM ? COK,4:55,19:15,14h 20m,1 stop,No info,8835
1999,Air India,21/05/2019,Kolkata,Banglore,CCU ? DEL ? BLR,17:30,5/22/2023 8:55,15h 25m,1 stop,No info,11936

In [38]:
for row in df_somerows.itertuples():
    cursor.execute('''
                INSERT INTO airline_data (airline,date_of_Journey,source,destination,Route,Dep_Time,Arrival_Time,Duration,  
    Total_Stops,Additional_Info,price)
                VALUES (?,?,?,?,?,?,?,?,?,?,?)
                ''',
                row.airline,
                row.date_of_Journey,
                row.source,
                row.destination,
                row.route,
                row.dep_Time,
                row.arrival_Time,
                row.duration,  
                row.total_Stops,
                row.additional_Info,
                row.price
                )

In [42]:
cursor.close()

In [43]:
connection_string.close()